#1)ლოგიკური ოპერატორებისა და შედარების ოპერატორებზე შეადგინეთ 10 მაგალითი,5 მაგალითმა უნდა დააბრუნოს False და 5 მაგალითმა უნდა დაააბრუნოს True
print(20==20 and 30>40)
print(46<34 and 4==4)
print(1>2 and 57==57)
print(30==30 and 45<20)
print(50==50 and 34>80)
#---------------------
print(20==20 or 30>40)
print(46<34 or 4==4)
print(1>2 or 57==57)
print(30==30 or 45<20)
print(50==50 or 34>80)
#---------------------

#2)კომენტარის სახით დაწერეთ თუ რა არის sequancing,iteration,selection აღწერე თითეული მათგანი თქვენი სიტყვებით
#swquancing-->

#iteration-->

#selecting-->


#6)შენი დავალებაა ტერმინალში გამოიყანო საყვარელი ავტომობილის სახელი ტერმინალში გამოიყენე for loop

for i in range(30):
    print("subaru")


#7)შენი დავალებაა ტერმინალში გამოიტანო შენი გვარი 100 ჯერ

for i in range(100):
    print("talaxadze")

#8)შენი დავალებაა ტერმინალში გამოიტანო საყვარელი ფერი 46 ჯერ

for i in range(46):
    print("tetri")

#9)შენი დავალებაა ტერმინალში გამოიტანო შენი სახელის პირველი ასო 32 ჯერ
for i in range(32):
    print("N")



