# 1)დაატრიალეთ for ციკლი 0 დან 38 ის ჩათვლით და გამოიტანე თითოეული რიცხვი ტერმინალში 

for i in range(0,39):   
    print(i)
# 2)დაატრილეთ for ციკლი 30 დან 40 მდე  და გამოიტანე თითოეული რიცხვი ტერმინალში 
 
for i in range(30,40):
    print(i)
# 3)დაატრიალეთ for ციკლი 12 იდან 120 მდე  და გამოიტანე თითოეული რიცხვი ტერმინალში 

for i in range(12,120):
    print(i)
# 4)დაატრიალეთ for ციკლი და გამოიტანეთ თქვენი სახელი 18 ჯერ ასევე გამოიტანეთ თქვენი ასაკიც,ერთ for ციკლში მოათავსეთ ორივე და ეგრე გააკეთეთ

for i in range(18):
    print("gegi")
    print(14)
# 5)დაატრიალეთ for ციკლი 10 დან 100 მდე 3 step ის გამოტოვებით და გამოიტანეთ თითოეული რიცხვი ტერმინალში
for i in range(10,100,3):
    print(i)
# 6)ტერმინალში გამოიტანეთ თქვენი საყვარელი ხილის სახელი 30 ჯერ და თან დანომრეთ ,მიიღეთ ქვემოთ მოცემულის ნაირი შედეგი

for i in range(1,31):
    print(str(i) + " alucha")
# 7)მომხმარებელს შემოატანინეთ მისი ასაკი 13 ჯერ გამოიყენე for loop
age = input("enter your age: ")
for i in range(14):
    print(age)
# 8)გამოიტანეთ თქვენი სახელი 10 ჯერ while loop ის გამოყენებით

i = 0
while i < 10:
    print("gegi")
    i = i + 1
# 9)დაითვალეთ 0 დან 24 მდე გამოიყენეთ while loop

i = 0
while i < 24:
    print(i)
    i = i + 1
# 10) იმუშაოვეთ ბევრი for და while loop ებზე მოიყვანეთ თქვენით მაგალითები სურვილისამებრ
for i in range(10,39,3):
    print(i)
i = 10
while i < 39:
    print(i)
    i = i + 3