#შექმენით სია ---> [980 , "saba", 231 , "kote" , "cico" , True , "gio" , 40.5] ამ სიის ბოლოში დაამატე სიტყვა --> "ianvari" და დაპრინტე საბოლოო სია ნახე დაემატა თუ არა
names=[980 , "saba", 231 , "kote" , "cico" , True , "gio" , 40.5]
names.append("ianvari")
print(names)
#----------------------------------
#ამ სიაში მეორე ინდექსზე დაამატე სიტყვა ---> "bati" და დაპრინტე საბოლოო სია ნახე დაემატა თუ არა
names2=[980 , "saba", 231 , "kote" , "cico" , True , "gio" , 40.5]
names2.insert(2,'bati')
print(names2)
#--------------------------------------------
#ამ სიიდან ამოშალე მე 5 ინდექსზე მდგომი ელემენტი და დაპრინტე საბოლოო სია ნახე ამოიშალა თუ არა
names3=[980 , "saba", 231 , "kote" , "cico" , True , "gio" , 40.5]
names3.pop(5)
print(names3)
#----------------------------------------------
#ამ სიიდან ამოშალე True და ასევე ამოშალე "kote" და დაპრინტე საბოლოო სია და ნახე ამოიშალა თუ არა
names4=[980 , "saba", 231 , "kote" , "cico" , True , "gio" , 40.5]
names4.remove(True)
names4.remove('kote')
print(names4)