a = float(input("შეიყვანე პირველი რიცხვი: "))
b = float(input("შეიყვანე მეორე რიცხვი: "))
c = float(input("შეიყვანე მესამე რიცხვი: "))


if a == b == c:
    print("სამივე რიცხვი ერთმანეთის ტოლია")
elif a == b:
    print("პირველი და მეორე რიცხვები ტოლია")
elif a == c:
    print("პირველი და მესამე რიცხვები ტოლია")
elif b == c:
    print("მეორე და მესამე რიცხვები ტოლია")
else:
    print("არცერთი რიცხვი არ ემთხვევა ერთმანეთს")





print("მოდი შევამოწმოთ რომელი სეზონია!")  

month = int(input("შეიყვანე რიცხვი 1-დან 12-მდე: "))

if month (12, 1, 2):
    print("ეს ზამთარია")
elif month  (3, 4, 5):
    print("ეს გაზაფხულია")
elif month (6, 7, 8):
    print("ეს ზაფხულია")
elif month  (9, 10, 11):
    print("ეს შემოდგომაა")
else:
    print("არასწორი რიცხვია, სცადე თავიდან.")
