#2)მომხმარებელს შემოაყვანინეთ ორი რიცხვი,შეადარეთ თუ პირველი რიცხვი მეტია მეორეზე,ასევე შეადარე თუ პირველი რიცხვი ნაკლებია მეორე რიცხვზე,და ასევე შეადარე თუ პირველი რიცხვი უდრის მეორე რიცხვს
num1=int(input())
num2=int(input())
print(num1>num2)
print(num1<num2)
print(num1==num2)


#3)მომხმარებელს შემოატანინეთ 5 სტრინგ ტიპის მნიშვნელობა,შენი დავალებაა მოახდინო მათი კონკატინაცია
name=input("nika")
car_model=input("bmw")
item=input("phone")
game=input("cod mb")
teacher=input("CHALAURI")
print(name+car_model+item+game+teacher)


#4)მომხმარებელს შემოატანინე 4 რიცხვი,შენი დავალებაა გაიგო ამ რიცხვების საშუალო არითმეტიკული(დღესაც ვისაუბრეთ ამაზე,ვნახოთ როგორ გაათმევთ თავს)
num1=int(input("enter number"))
num2=int(input("enter number"))
num3=int(input("enter number"))
print((num1+num2+num3)/3)


#5)შექმენი 4 ცვლადი,ამ ცვლადებშ შეინახე 4 განსხვავებული მონაცემთა ტიპის ელემენტები და დაპრინტე მათ ტიპი(გამოიყენეთ შესაბამისი ფუნქცია)
name="nika"
number=1000
meeter=2.4
lie= False
print(type(name))
print(type(number))
print(type(meeter))
print(type(lie))


#6)შექმენი 2 ცვლადი,შეინახე ორივე ცვლადში სტრინგ ტიპის მნიშვნელობები დაშეადარე ისინი არიან თუ არა ერთნაირები(უდრის თ არა ერთმანეთს)
name1="gela"
name2="maia"
print(name1>name2)
print(name1<name2)
print(name2==name1)


#7)შექმენი 4 ცვლადი,სადაც გექნება მოთავსებული რიცხვები ოღონდ სტრინგის სახით მაგ: "40",გადაიყვანე ეს სტრინგი რიცხვები ინტეჯერში(გამოიყენე შესაბამისი ფუნქცია) და გაიგე ამ ოთხი რიცხვის ჯამი
num1=int("67")
num2=int("23")
num3=int("65")
num4=int("98")
print(num1+num2+num3+num4)

#8)შექმენი 3 ცვლადი,ამ ცვლადებში შეინახეთ ინტეჯერ ტიპის მონაცემები,შენი დავალებაა ეს რიცხვები გაასტრინგო(გამოიყენე შესაბამისი ფუნქცია) და გამოიტანო ეს რიცხვები ერთ წინადადებაში. მაგ:304050
coin1=str("40")
coin2=str("82")
coin3=str("98")
print(coin1+coin2+coin3)




