print(3 ** 4)   
print(6 ** 2)   
print(9 ** 1)   


print(11 // 2)   
print(20 // 6) 
print(17 // 5)   

print(11 % 2)
print(20 % 6)
print(17 % 5)

# **--> ხარისხშიაყავს რიცხვები ანუ რიცხვებს თავის თვზე ამრავლებს
# //--> აბრუნებს მთელ რიცხვს გაყოფის შემდეგ
# %--> პოულობს ნაშთს გაყოფისას
#-----------------------------------------------------------------------------------------------


# ცვლადი (variable):
# → ცვლადი ინახავს მხოლოდ ერთ მნიშვნელობას.

# სია (list):
# → სია შეიძლება შეიცავდეს ერთზე მეტ მნიშვნელობას ერთ ცვლადში.
# → სიაში ელემენტები იწერება [ ] ფრჩხილებში და ერთმანეთისგან გამოეყოფა მძიმით.


# - ცვლადი → ინახავს მხოლოდ ერთ მონაცემს
# - სია → ინახავს რამდენიმე მონაცემს ერთდროულად

#სიებს ვიყენებთ მაშინ როდესაც გვინდა ერთ ცვლადში ბევრი მნიშვნელობის შენახვა,



my_list = [
    10,              
    3.14,            
    "გამარჯობა",     
    True,    
    ]

print(my_list)  #

