#ჩვენ ვისწავლეთ 4 მონაცემთა ტიპი: 1.string 2.integer 3.float 4.boolean

#string არის ტექსტი რომელიც მოცემულია ბრჭყალებში მაგ:"მაგარი" ეს უკვე არის string ტიპის მონაცემი(ანუ მონაცემთა ტიპი არის string როდესაც ის ბრჭყალებში იმყოფება)


#integer-არი მთელი რიცხვები მაგ: 10, 62, 1231.ანუ ჩვეულებრივი რიცხვი. ინტეჯერ ტიპის მონაცემს “” (ბრჭყალები) არ ჭირდება   (და თუ ბრჭყალებშია რიცხვი მისი მონაცემთა ტიპი არის სტრინგი არათუ ინტეჯერი).

#float—ათწილადი რიცხვები. მაგ: 1.20, 18.34და სხვა ასევე არც მას ჭირდება ბრჭყალები(შესაბამისად ნებისმიერი ათწილადი  რიცხვი არის floati)


print("magari kaci")

print(90)

#ცვლადი არის ე.წ ყუთი რომელსაც აქვს სახელი(name) და მასში შეგვიძლია შევინახოთ ნებისმიერი მონაცემთა ტიპი და მათი მნიშვნელობა



name="nika talakhadze"
height="1.80"
age="16"